cases/S03/S03/system/extrudeMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      extrudeProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


constructFrom mesh;
sourceCase "$FOAM_CASE";

sourcePatches (rightWall);
exposedPatchName rightWall;

extrudeModel    linearDirection;
    nLayers 14;
    expansionRatio 1.1;
    
    direction       (1 0 0);
        thickness       3.44;


flipNormals false;
mergeFaces false;
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
